#+STARTUP: indent

# IMPORTANT: run (org-babel-execute-buffer) first!
# see 6 Using Custom Classes at http://orgmode.org/worg/org-tutorials/org-latex-export.html 
# and http://emacs-fu.blogspot.com/2009/10/writing-presentations-with-org-mode-and.html


#+TITLE: A brief introduction to\newline reproducible research with\newline Emacs' Org mode and R
#+AUTHOR: Bernd Weiß
#+DATE: \footnotesize{2012-07-06}
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:


# Babel settings
#+PROPERTY: session *R*
#+PROPERTY: tangle ../src/ps2012-07-KRUG_org_R.R
#+PROPERTY: comments yes
#+PROPERTY: results output
#+PROPERTY: exports both


#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [bigger]
#+LaTeX_HEADER: \institute{\url{http://berndweiss.net} \\ \url{bernd.weiss@uni-koeln.de}}
#+latex_header: \mode<beamer>{\usecolortheme{seagull}}



#+BEAMER_FRAME_LEVEL: 3

#+LATEX_HEADER: \usepackage{attrib}

#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{bm}
#+LATEX_HEADER: \usepackage[babel]{csquotes}
#+LaTeX_HEADER: \usepackage{blindtext} 
#+latex_header: \usepackage{helvet} %\usepackage{lucidabr}

#+latex_header: \AtBeginSection[]{ \begin{frame} \frametitle{Topic} \begin{footnotesize} \tableofcontents[currentsection, currentsubsection] \end{footnotesize} \end{frame} }

#+latex_header: \AtBeginSubsection[]{ \begin{frame} \frametitle{Topic} \begin{footnotesize} \tableofcontents[currentsection, currentsubsection] \end{footnotesize} \end{frame} }


**** R code block                                                  :B_column:
:PROPERTIES:
:BEAMER_env: block
:END:
#+BEGIN_EXAMPLE
This is a short sentence. This is another sentence. 
And, finally, here comes some R code:

#+BEGIN_SRC R
set.seed(1)
x1 <- rnorm(100) 
mean(x1) 
x1.sd <- sd(x1) 
#+END_SRC

#+RESULTS:
: [1] 0.1088874

#+END_EXAMPLE

**** Evaluated and exported R code block                           :B_column:
:PROPERTIES:
:BEAMER_env: block
:END:

This is a short sentence. This is another sentence. And, finally, here comes some R code:
#+BEGIN_SRC R
set.seed(1)
x1 <- rnorm(100)
mean(x1)
x1.sd <- sd(x1)
#+END_SRC

#+RESULTS:
: [1] 0.1088874


**** R code block                                                  :B_column:
:PROPERTIES:
:BEAMER_env: block
:END:
#+BEGIN_EXAMPLE
This is a short sentence. Hey, there is another 
sentence. And, finally, here comes some R code:

#+BEGIN_SRC R :results output :exports results
set.seed(1)
x1 <- rnorm(100) 
mean(x1) 
x1.sd <- sd(x1) 
#+END_SRC

#+RESULTS:
: [1] 0.1088874

#+END_EXAMPLE

**** Evaluated and exported R code block                           :B_column:
:PROPERTIES:
:BEAMER_env: block
:END:

This is a short sentence.  Hey, there is another sentence. And, finally, here comes some R code:

#+BEGIN_SRC R :results output :exports results
set.seed(1)
x1 <- rnorm(100)
mean(x1)
x1.sd <- sd(x1)
#+END_SRC

#+RESULTS:
: [1] 0.1088874



*** Chaining (evaluated)

Define variable =y= in a Python code block: 
#+name: chainexamp
#+begin_src python :results value :session *python*
y = 10**4
y
#+end_src

#+RESULTS: chainexamp
: 10000


Then pass variable =y= to an R code block:
#+BEGIN_SRC R :var x=chainexamp :session *R2*
print(x)
print(x*2)
#+END_SRC

#+RESULTS:
: [1] 10000
: [1] 20000




